app/controllers/games_controller.rb

  def index
    @games_by_round = Game.find_and_collect_by_round
---
SELECT * FROM `games` WHERE (previous_game_id IS NULL) LIMIT 1

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 3251)

  def update
    @game = Game.find(params[:id])

      if @game.update_attributes(params[:game])
---
SELECT * FROM `games` WHERE (`games`.previous_game_id = 128)
UPDATE `games` SET `player2_id` = 3, `updated_at` = '2009-02-24 16:36:32' WHERE `id` = 128