app/controllers/players_controller.rb

SELECT * FROM "players" WHERE ("players"."id" = 1626)
---
  def edit
    @player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1626)
---
  def update
    @player = Player.find(params[:id])